src/Documents/ЗаписиУСН/ЗаписиУСН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаписиУСН</name>
  <registerRecords>AccumulationRegister.ПримененныеВычетыПоНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.КнигаУчетаДоходовИРасходов</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛДоходы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаписей</name>
    <type>
      <types>EnumRef.ВидыЗаписейФормированийКУДиР</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>999</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаявлениеОЗачетеВСчетПредстоящейОбязанности</types>
      <types>DocumentRef.ЗакрытиеМесяца</types>
      <types>DocumentRef.ОперацияПоЕдиномуНалоговомуСчету</types>
      <types>DocumentRef.УведомлениеОбИсчисленныхСуммахНалогов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаписиКУДиР</name>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоходВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоходБаза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасходВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасходБаза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПервичныйДокумент</name>
      <type>
        <types>DocumentRef.СписаниеЗапасов</types>
        <types>DocumentRef.ЗаписиУСН</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ОтчетКомиссионера</types>
        <types>DocumentRef.ПеремещениеЗапасов</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.РасходСоСчета</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ПоступлениеВКассу</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.КорректировкаПоступления</types>
        <types>DocumentRef.СборкаЗапасов</types>
        <types>DocumentRef.РаспределениеЗатрат</types>
        <types>DocumentRef.ОтчетОРозничныхПродажах</types>
        <types>DocumentRef.ОтчетКомитенту</types>
        <types>DocumentRef.РасходИзКассы</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ПоступлениеНаСчет</types>
        <types>DocumentRef.УведомлениеОбИсчисленныхСуммахНалогов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПервичногоДокумента</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПервичногоДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикПоОС</name>
    <attributes>
      <name>ПериодПризнания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ЗаписиУСН/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	ЗаписиУСНЗаписиКУДиР.ДоходВсего КАК ДоходВсего,
	|	ЗаписиУСНЗаписиКУДиР.ДоходБаза КАК ДоходБаза,
	|	ЗаписиУСНЗаписиКУДиР.РасходВсего КАК РасходВсего,
	|	ЗаписиУСНЗаписиКУДиР.РасходБаза КАК РасходБаза,
	|	ЗаписиУСНЗаписиКУДиР.НДС КАК НДС,
	|	ЗаписиУСНЗаписиКУДиР.Содержание КАК Содержание,
	|	ЗаписиУСНЗаписиКУДиР.ПервичныйДокумент КАК ПервичныйДокумент,
	|	ЗаписиУСНЗаписиКУДиР.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
	|	ЗаписиУСНЗаписиКУДиР.НомерПервичногоДокумента КАК НомерПервичногоДокумента,
	|	ЗаписиУСНЗаписиКУДиР.Ссылка.ВидЗаписей КАК ВидЗаписи,
	|	ЗаписиУСНЗаписиКУДиР.НомерСтроки КАК НомерСтрокиДокумента
	|ИЗ
	|	Документ.ЗаписиУСН.ЗаписиКУДиР КАК ЗаписиУСНЗаписиКУДиР
	|ГДЕ
	|	ЗаписиУСНЗаписиКУДиР.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписиУСНГрафикПоОС.ПериодПризнания КАК Период,
	|	&Организация КАК Организация,
	|	ЗаписиУСНГрафикПоОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ЗаписиУСНГрафикПоОС.Сумма КАК Сумма
	|ИЗ
	|	Документ.ЗаписиУСН.ГрафикПоОС КАК ЗаписиУСНГрафикПоОС
	|ГДЕ
	|	ЗаписиУСНГрафикПоОС.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Период", ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("Организация", ДокументСсылка.Организация);
	
	
	Результат = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаКнигаУчетаДоходовИРасходов", Результат[0].Выгрузить());
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаГрафикПризнанияРасходовНаОСиНМА",
		Результат[1].Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
